tsung/new_tests/day_trader.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='100000'/>
  </clients>

  <servers>
    <server host="BeepBoopSquad.eba-dzbukdri.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="15" unit="second">
      <users arrivalrate="96" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="15" unit="second">
      <users arrivalrate="96" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="15" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
  </load>


  <options>
    <option name="file_server" id="default" value="../data/users.csv"/>
    <option name="file_server" id="stocks" value="../data/stocks5.csv"/>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"/>
  </options>

  <sessions>
    <session name="fundamental_investor" probability="100" type="ts_http">

      <setdynvars sourcetype="file" fileid="default" delimiter="," order="iter">
        <var name="username"/>
        <var name="password"/>
        <var name="balance"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="stock_id"/>
      </setdynvars>

      <setdynvars sourcetype="file" fileid="stocks" delimiter="," order="iter">
        <var name="stock_symbol"/>
        <var name="stock_name"/>
        <var name="stock_share_price"/>
      </setdynvars>

      <!-- Log In -->
      <transaction name="visit_login_page">
        <request>
          <http url="/login"
                method="GET"
          />
        </request>
      </transaction>

      <transaction name="submit_login_creds">
        <request subst="true">
          <http url="/sessions.json"
                method="POST"
                content_type="application/json"
                contents="{&quot;name&quot;: &quot;%%_username%%&quot;, &quot;password&quot;: &quot;%%_password%%&quot;}"
          />
        </request>
      </transaction>

      <!-- Homepage -->
      <transaction name="visit_homepage">
        <request>
          <http url="/"
                method="GET"
          />
        </request>
      </transaction>

      <!-- Wait -->
      <thinktime value="5" random="true"/>

      <!-- View Transactions Page -->
      <transaction name="view_new_transactions_page">
        <request>
          <http url="/transactions/new"
                method="GET"
          />
        </request>
      </transaction>

      <!-- Buy Stock -->
      <transaction name="buy_stock">
        <request subst="true">
          <http url="/transactions"
                method="POST"
                content_type="application/json"
                contents="{&quot;stock_symbol&quot;: &quot;%%_stock_symbol%%&quot;, &quot;num_shares&quot;: 5, &quot;transaction_type&quot;: &quot;buy&quot;}"
          />
        </request>
      </transaction>

      <!-- Wait -->
      <thinktime value="5" random="true"/>

      <!-- View Transactions Page -->
      <transaction name="view_new_transactions_page_2">
        <request>
          <http url="/transactions/new"
                method="GET"
          />
        </request>
      </transaction>

      <!-- Sell Stock -->
      <transaction name="sell_stock">
        <request subst="true">
          <http url="/transactions"
                method="POST"
                content_type="application/json"
                contents="{&quot;stock_symbol&quot;: &quot;%%_stock_symbol%%&quot;, &quot;num_shares&quot;: 5, &quot;transaction_type&quot;: &quot;sell&quot;}"
          />
        </request>
      </transaction>

    </session>
  </sessions>
</tsung>