tsung/new_tests/local_test.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" [
        <!ENTITY login_post_session SYSTEM "tsung_recorder20180717.xml">
        ]>
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='1000'/>
  </clients>
  <servers>
    <server host="localhost" port="3000" type="tcp" />
  </servers>
  <load>
    <arrivalphase phase="1" duration="3" unit="second">
      <users arrivalrate="1" unit="second" />
    </arrivalphase>
    <arrivalphase phase="2" duration="3" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
  </load>
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000" />
  </options>
  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <!-- Homepage -->
      <request>
        <http url="/"
              method="GET"
        />
      </request>
      <!-- Sign Up -->
<!--      <request>-->
<!--        <http url="/users.json"-->
<!--              method="POST"-->
<!--              content_type='application/json'-->
<!--              contents_from_file="../request_body/user_body.json"-->
<!--        />-->
<!--      </request>-->
<!--      &lt;!&ndash; Wait &ndash;&gt;-->
<!--      <thinktime value="1" random="true"/>-->
    </session>
  </sessions>
</tsung>