tsung/new_tests/registration.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='100000'/>
  </clients>

  <servers>
    <server host="BeepBoopSquad.eba-dzbukdri.us-west-2.elasticbeanstalk.com" port="80" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second" />
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
<!--    <arrivalphase phase="3" duration="5" unit="second">-->
<!--      <users arrivalrate="4" unit="second" />-->
<!--    </arrivalphase>-->
<!--    <arrivalphase phase="4" duration="5" unit="second">-->
<!--      <users arrivalrate="8" unit="second" />-->
<!--    </arrivalphase>-->
<!--    <arrivalphase phase="5" duration="5" unit="second">-->
<!--      <users arrivalrate="16" unit="second" />-->
<!--    </arrivalphase>-->
<!--    <arrivalphase phase="6" duration="5" unit="second">-->
<!--      <users arrivalrate="32" unit="second" />-->
<!--    </arrivalphase>-->
<!--    <arrivalphase phase="7" duration="5" unit="second">-->
<!--      <users arrivalrate="64" unit="second" />-->
<!--    </arrivalphase>-->
<!--    <arrivalphase phase="8" duration="5" unit="second">-->
<!--      <users arrivalrate="128" unit="second" />-->
<!--    </arrivalphase>-->
<!--    <arrivalphase phase="9" duration="5" unit="second">-->
<!--      <users arrivalrate="256" unit="second" />-->
<!--    </arrivalphase>-->
<!--    <arrivalphase phase="10" duration="5" unit="second">-->
<!--      <users arrivalrate="512" unit="second" />-->
<!--    </arrivalphase>-->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000" />
  </options>

  <sessions>
    <session name="registration" probability="100" type="ts_http">
      <!-- Homepage -->
      <request>
        <http url="/"
              method="GET"
        />
      </request>
      <!-- Sign Up -->
      <request>
        <http url="/users.json"
              method="POST"
              content_type='application/json'
              contents_from_file="../request_body/user_body.json"
        />
      </request>
<!--      &lt;!&ndash; Log In &ndash;&gt;-->
<!--      <request>-->
<!--        <http url="/sessions.json"-->
<!--              method="POST"-->
<!--              content_type='application/json'-->
<!--              contents_from_file="../request_body/login_body.json"-->
<!--        />-->
<!--      </request>-->
<!--      &lt;!&ndash; Homepage &ndash;&gt;-->
<!--      <request>-->
<!--        <http url="/"-->
<!--              method="GET"-->
<!--        />-->
<!--      </request>-->
<!--      &lt;!&ndash; Wait &ndash;&gt;-->
<!--      <thinktime value="5" random="true"/>-->
<!--      &lt;!&ndash; Visit Exchanges Endpoint &ndash;&gt;-->
<!--      <request>-->
<!--        <http url="/exchanges.json"-->
<!--              method="GET"-->
<!--        />-->
<!--      </request>-->
<!--      &lt;!&ndash; Wait &ndash;&gt;-->
<!--      <thinktime value="5" random="true"/>-->
<!--      &lt;!&ndash; Visit Exchanges Endpoint &ndash;&gt;-->
<!--      <request>-->
<!--        <http url="/exchanges.json"-->
<!--              method="POST"-->
<!--              content_type='application/json'-->
<!--              contents_from_file="../request_body/exchanges_body.json"-->
<!--        />-->
<!--      </request>-->
    </session>
  </sessions>
</tsung>