tsung/new_tests/registration_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='1000'/>
  </clients>
  <servers>
    <server host="BeepBoopSquad.eba-dzbukdri.us-west-2.elasticbeanstalk.com" port="443" type="ssl" />
  </servers>
  <load>
    <arrivalphase phase="1" duration="3" unit="second">
      <users arrivalrate="1" unit="second" />
    </arrivalphase>
    <arrivalphase phase="2" duration="3" unit="second">
      <users arrivalrate="2" unit="second" />
    </arrivalphase>
  </load>
  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000" />
  </options>
  <sessions>
    <session name="registration" probability="100" type="ts_http">
      <!-- Homepage -->
      <request>
        <http url="/"
              method="GET"
        />
      </request>
      <!-- Sign Up -->
      <request>
        <http url="/users.json"
              method="POST"
              content_type='application/json'
              contents_from_file="../request_body/user_body.json"
        />
      </request>
      <!-- Log In -->
      <request>
        <http url="/sessions.json"
              method="POST"
              content_type='application/json'
              contents_from_file="../request_body/login_body.json"
        />
      </request>
      <!-- Homepage -->
      <request>
        <http url="/"
              method="GET"
        />
      </request>
      <!-- Wait -->
      <thinktime value="1" random="true"/>
    </session>
  </sessions>
</tsung>